In [2]:
from sklearn import tree
import pandas as pd

In [3]:
datawith = pd.read_csv('with.csv')
datawith.loc[datawith['Married']=="Yes",'Married']=1
datawith.loc[datawith['Married']=='No','Married']=0
datawith.loc[datawith['Education']=="Graduate",'Education']=1
datawith.loc[datawith['Education']=='Not Graduate','Education']=0
datawith.loc[datawith['Self_Employed']=="Yes",'Self_Employed']=1
datawith.loc[datawith['Self_Employed']=='No','Self_Employed']=0
datawith.loc[datawith['Property_Area']=="Urban",'Property_Area']=0
datawith.loc[datawith['Property_Area']=='Semiurban','Property_Area']=1
datawith.loc[datawith['Property_Area']=='Rural', 'Property_Area']=2
datawith.head()

,Unnamed: 0,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0,0,0,1,0,5849,0.0,146.412162,360.0,1.0,0,1
1,1,1,1,1,0,4583,1508.0,128.000000,360.0,1.0,2,0
2,2,1,0,1,1,3000,0.0,66.000000,360.0,1.0,0,1
3,3,1,0,0,0,2583,2358.0,120.000000,360.0,1.0,0,1
4,4,0,0,1,0,6000,0.0,141.000000,360.0,1.0,0,1

In [4]:
datawo = pd.read_csv('without.csv')
datawo.loc[datawo['Married']=="Yes",'Married']=1
datawo.loc[datawo['Married']=='No','Married']=0
datawo.loc[datawo['Education']=="Graduate",'Education']=1
datawo.loc[datawo['Education']=='Not Graduate','Education']=0
datawo.loc[datawo['Self_Employed']=="Yes",'Self_Employed']=1
datawo.loc[datawo['Self_Employed']=='No','Self_Employed']=0
datawo.loc[datawo['Property_Area']=="Urban",'Property_Area']=0
datawo.loc[datawo['Property_Area']=='Semiurban','Property_Area']=1
datawo.loc[datawo['Property_Area']=='Rural', 'Property_Area']=2
datawo.head()

,Unnamed: 0,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,333,1,0,1,0,63337,0.0,490.0,180,1,0,1
1,171,1,3,1,0,51763,0.0,700.0,300,1,0,1
2,155,1,3,1,0,39999,0.0,600.0,180,0,1,1
3,185,1,0,1,1,39147,4750.0,120.0,360,1,1,1
4,443,0,1,1,0,37719,0.0,152.0,360,1,1,1

In [5]:
target1 = datawith["Loan_Status"]
target2 = datawo["Loan_Status"]

In [6]:
data1 = datawith.drop("Loan_Status", axis=1)
data1 = data1.drop('Unnamed: 0', axis=1)
feature1_names = data1.columns
data1.head()
data2 = datawo.drop("Loan_Status", axis=1)
data2 = data2.drop('Unnamed: 0', axis=1)
feature2_names = data2.columns
data2.head()

,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,1,0,1,0,63337,0.0,490.0,180,1,0
1,1,3,1,0,51763,0.0,700.0,300,1,0
2,1,3,1,0,39999,0.0,600.0,180,0,1
3,1,0,1,1,39147,4750.0,120.0,360,1,1
4,0,1,1,0,37719,0.0,152.0,360,1,1

In [7]:
data1.head()

,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,0,0,1,0,5849,0.0,146.412162,360.0,1.0,0
1,1,1,1,0,4583,1508.0,128.000000,360.0,1.0,2
2,1,0,1,1,3000,0.0,66.000000,360.0,1.0,0
3,1,0,0,0,2583,2358.0,120.000000,360.0,1.0,0
4,0,0,1,0,6000,0.0,141.000000,360.0,1.0,0

In [8]:
from sklearn.model_selection import train_test_split
X1_train, X1_test, y1_train, y1_test = train_test_split(data1, target1, random_state=42)
X2_train, X2_test, y2_train, y2_test = train_test_split(data2, target2, random_state=42)

In [9]:
clf1 = tree.DecisionTreeClassifier()
clf1 = clf1.fit(X1_train, y1_train)
clf1.score(X1_test, y1_test)

0.70779220779220775

In [10]:
clf2 = tree.DecisionTreeClassifier()
clf2 = clf2.fit(X2_train, y2_train)
clf2.score(X2_test, y2_test)

0.71999999999999997

In [11]:
from sklearn.ensemble import RandomForestClassifier
rf1 = RandomForestClassifier(n_estimators=200)
rf1 = rf1.fit(X1_train, y1_train)
rf1.score(X1_test, y1_test)

0.79870129870129869

In [12]:
rf2 = RandomForestClassifier(n_estimators=200)
rf2 = rf2.fit(X2_train, y2_train)
rf2.score(X2_test, y2_test)

0.81333333333333335

In [13]:
sorted(zip(rf1.feature_importances_, feature1_names), reverse=True)

[(0.30947244306279559, 'Credit_History'),
 (0.20572412874277787, 'ApplicantIncome'),
 (0.17874021118328656, 'LoanAmount'),
 (0.10572785629648049, 'CoapplicantIncome'),
 (0.048891006894782756, 'Loan_Amount_Term'),
 (0.047169504360657415, 'Property_Area'),
 (0.04466517933624288, 'Dependents'),
 (0.02535140017401399, 'Married'),
 (0.018746211109256145, 'Education'),
 (0.01551205883970584, 'Self_Employed')]

In [14]:
sorted(zip(rf2.feature_importances_, feature2_names), reverse=True)

[(0.3415925334840571, 'Credit_History'),
 (0.19793264337441233, 'ApplicantIncome'),
 (0.15957566322961461, 'LoanAmount'),
 (0.11545110291262117, 'CoapplicantIncome'),
 (0.043541203088164109, 'Loan_Amount_Term'),
 (0.042275988243174974, 'Dependents'),
 (0.040343358664560104, 'Property_Area'),
 (0.023335780232143062, 'Education'),
 (0.021605965530499368, 'Married'),
 (0.014345761240752876, 'Self_Employed')]